EDT/ZUP/zup_edt/src/Documents/ПеречислениеНДФЛВБюджет/ПеречислениеНДФЛВБюджет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеречислениеНДФЛВБюджет</name>
  <registerRecords>AccumulationRegister.УплатаНДФЛНалоговымиАгентамиКРаспределению</registerRecords>
  <registerRecords>AccumulationRegister.НДФЛПеречисленный</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСБюджетомПоНДФЛ</registerRecords>
  <attributes>
    <name>МесяцНалоговогоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрацияВНалоговомОргане</name>
    <type>
      <types>CatalogRef.РегистрацииВНалоговомОргане</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПлатежа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяФинансирования</name>
    <type>
      <types>CatalogRef.СтатьиФинансированияЗарплата</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <type>
      <types>CatalogRef.СтатьиРасходовЗарплата</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлатежноеПоручениеНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлатежноеПоручениеДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитыПлатежногоПоручения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Бухгалтер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ведомости</name>
    <attributes>
      <name>Ведомость</name>
      <type>
        <types>DocumentRef.ВедомостьНаВыплатуЗарплатыРаздатчиком</types>
        <types>DocumentRef.ВыплатаБывшимСотрудникам</types>
        <types>DocumentRef.ВедомостьПрочихДоходовВКассу</types>
        <types>DocumentRef.РегистрацияПрочихДоходов</types>
        <types>DocumentRef.ДивидендыФизическимЛицам</types>
        <types>DocumentRef.ВедомостьНаВыплатуЗарплатыПеречислением</types>
        <types>DocumentRef.ВедомостьНаВыплатуЗарплатыВБанк</types>
        <types>DocumentRef.ВедомостьПрочихДоходовВБанк</types>
        <types>DocumentRef.ВедомостьПрочихДоходовПеречислением</types>
        <types>DocumentRef.ВедомостьНаВыплатуЗарплатыВКассу</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/ZUP/zup_edt/src/Documents/ПеречислениеНДФЛВБюджет/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	ЗарплатаКадры.ЗаполнитьНаборыПоОрганизации(ЭтотОбъект, Таблица, "Организация");
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
	
		Если ДанныеЗаполнения.Свойство("ЗаполнениеПоВедомости") Тогда
			
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения.ЗаполнениеПоВедомости);
			НоваяСтрока = Ведомости.Добавить();
			НоваяСтрока.Ведомость = ДанныеЗаполнения.ЗаполнениеПоВедомости.Ведомость;
			
			ЗапрашиваемыеЗначения = Новый Структура;
			ЗапрашиваемыеЗначения.Вставить("Организация", 		"Организация");
			ЗапрашиваемыеЗначения.Вставить("Ответственный",		"Ответственный");
			ЗапрашиваемыеЗначения.Вставить("ГлавныйБухгалтер", 	"ГлавныйБухгалтер");
			ЗапрашиваемыеЗначения.Вставить("Бухгалтер", 		"Бухгалтер");
			ЗарплатаКадры.ЗаполнитьЗначенияВФорме(ЭтотОбъект, ЗапрашиваемыеЗначения, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("Организация"));
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыПлатежногоПоручения = РеквизитыПлатежногоПоручения();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ДанныеДляПроведения = ДанныеДляПроведения();
	
	УчетНДФЛ.СформироватьПеречисленныйНалог(Ссылка, Движения, Отказ, Организация, ДатаПлатежа,
						ДанныеДляПроведения.ПеречисленныйНалог, ДанныеДляПроведения.ФизическиеЛица, РегистрацияВНалоговомОргане);
	
	// Регистрация обязательств.
	УчетНДФЛ.СформироватьНДФЛПеречисленный(Движения, Отказ);
	
	УплатаНДФЛКРаспределению = Движения.УплатаНДФЛНалоговымиАгентамиКРаспределению.ВыгрузитьКолонки();
	Для каждого СтрокаДвижений Из Движения.УплатаНДФЛНалоговымиАгентамиКРаспределению Цикл
		НоваяСтрока = УплатаНДФЛКРаспределению.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДвижений);
		Если СтрокаДвижений.ВидДвижения = ВидДвиженияНакопления.Расход Тогда
			НоваяСтрока.Сумма = - НоваяСтрока.Сумма;
		КонецЕсли;
	КонецЦикла;
	УплатаНДФЛКРаспределению.Свернуть("Период,Организация,РегистрацияВНалоговомОргане","Сумма");
	УчетНДФЛ.СформироватьНДФЛПеречисленный(Движения, Отказ, УплатаНДФЛКРаспределению);
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСтатьиФинансированияЗарплатаРасширенный") Тогда
		// Дополним обязательства сведениями по статьям.
		БазаРаспределения = Движения.НДФЛПеречисленный.Выгрузить();
		БазаРаспределения.Свернуть("ФизическоеЛицо,РегистрацияВНалоговомОргане,СтатьяФинансирования,СтатьяРасходов", "Сумма");
		БазаРаспределения.ЗаполнитьЗначения(СтатьяФинансирования, "СтатьяФинансирования");
		БазаРаспределения.ЗаполнитьЗначения(СтатьяРасходов, "СтатьяРасходов");
		
		ДанныеДляДополнения = ОтражениеЗарплатыВУчете.НовоеОписаниеПараметровДополненияНДФЛСтатьями();
		ДанныеДляДополнения.БазаРаспределения 	= БазаРаспределения;
		ДанныеДляДополнения.ПоляОтбора 			= "ФизическоеЛицо,РегистрацияВНалоговомОргане";
		ОтражениеЗарплатыВУчете.ДополнитьНДФЛПеречисленныйСведениямиОРаспределенииПоСтатьям(Движения, ДанныеДляДополнения);;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.РасчетыСБюджетомПоНДФЛ") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("РасчетыСБюджетомПоНДФЛ");
		Модуль.РасчетыСБюджетомПоНДФЛЗарегистрироватьНДФЛПеречисленный(Движения, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЗарплатаКадры.ПроверитьКорректностьДаты(Ссылка, ДатаПлатежа, "Объект.ДатаПлатежа", Отказ, НСтр("ru='Дата платежа'"), , , Ложь);
	ЗарплатаКадры.ПроверитьКорректностьДаты(Ссылка, ПлатежноеПоручениеДата, "Объект.ПлатежноеПоручениеДата", Отказ, НСтр("ru='Дата платежного поручения'"), , , Ложь);
	
	ПроверкаЗаполненияФинансирования = Документы.ПеречислениеНДФЛВБюджет.РежимПроверкиЗаполненияФинансирования();
	
	Если Не ПроверкаЗаполненияФинансирования.СтатьяФинансирования Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "СтатьяФинансирования");
	КонецЕсли;
	
	Если Не ПроверкаЗаполненияФинансирования.СтатьяРасходов Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "СтатьяРасходов");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Ведомости.Очистить();
	Сумма = 0;
	ДатаПлатежа 			= Неопределено;
	ПлатежноеПоручениеДата 	= Неопределено;
	СтатьяФинансирования 	= Неопределено;
	СтатьяРасходов 			= Неопределено;
	ПлатежноеПоручениеНомер = "";
	РеквизитыПлатежногоПоручения = "";
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РеквизитыПлатежногоПоручения()
	
	РеквизитыПлатежногоПорученияПоДатеНомеру =  "";
	
	Если ЗначениеЗаполнено(ПлатежноеПоручениеНомер) Или ЗначениеЗаполнено(ПлатежноеПоручениеДата) Тогда
		РеквизитыПлатежногоПорученияПоДатеНомеру = 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			 	НСтр("ru = '№ %1 от %2'"), 
				?(ЗначениеЗаполнено(ПлатежноеПоручениеНомер), ПлатежноеПоручениеНомер, НСтр("ru = 'б/н'")),  
				Формат(ПлатежноеПоручениеДата, "ДЛФ=D"));
	КонецЕсли;		

	Возврат РеквизитыПлатежногоПорученияПоДатеНомеру
	
КонецФункции	

Функция ПеречисленныйНалог()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПеречислениеНДФЛ.ДатаПлатежа КАК Период,
	|	ПеречислениеНДФЛ.Сумма КАК Сумма,
	|	ПеречислениеНДФЛ.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	ПеречислениеНДФЛ.Организация КАК Организация,
	|	ПеречислениеНДФЛ.ПлатежноеПоручениеНомер КАК ПлатежноеПоручениеНомер,
	|	ПеречислениеНДФЛ.ПлатежноеПоручениеДата КАК ПлатежноеПоручениеДата,
	|	ПеречислениеНДФЛ.СтатьяФинансирования КАК СтатьяФинансирования,
	|	ПеречислениеНДФЛ.СтатьяРасходов КАК СтатьяРасходов
	|ИЗ
	|	Документ.ПеречислениеНДФЛВБюджет КАК ПеречислениеНДФЛ
	|ГДЕ
	|	ПеречислениеНДФЛ.Ссылка = &Ссылка";
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция ДанныеДляПроведения()

	ДанныеДляПроведения = Новый Структура("ПеречисленныйНалог, ФизическиеЛица");
	
	ДанныеДляПроведения.ПеречисленныйНалог = ПеречисленныйНалог();
	
	Если Ведомости.Количество() > 0 Тогда
		
		ВедомостиДокумента = Ведомости.ВыгрузитьКолонку("Ведомость");
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ведомости",   ВедомостиДокумента);
		Запрос.УстановитьПараметр("РегистрацияВНалоговомОргане",   РегистрацияВНалоговомОргане);
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НДФЛКПеречислению.ФизическоеЛицо КАК ФизическоеЛицо
		|ИЗ
		|	РегистрНакопления.НДФЛКПеречислению КАК НДФЛКПеречислению
		|ГДЕ
		|	НДФЛКПеречислению.Регистратор В(&Ведомости)
		|	И НДФЛКПеречислению.РегистрацияВНалоговомОргане = &РегистрацияВНалоговомОргане";
		ДанныеДляПроведения.ФизическиеЛица = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ФизическоеЛицо");
		
	КонецЕсли;
	
	Возврат ДанныеДляПроведения;
	
КонецФункции


#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
